In [70]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import numpy as np
import re

In [71]:
link1 = "https://datasets.imdbws.com/name.basics.tsv.gz"
df1 = pd.read_csv(link1, sep="\t", compression='gzip')
df1

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000001,Fred Astaire,1899,1987,"soundtrack,actor,miscellaneous","tt0072308,tt0045537,tt0050419,tt0053137"
1,nm0000002,Lauren Bacall,1924,2014,"actress,soundtrack","tt0037382,tt0075213,tt0117057,tt0038355"
2,nm0000003,Brigitte Bardot,1934,\N,"actress,soundtrack,music_department","tt0057345,tt0054452,tt0056404,tt0049189"
3,nm0000004,John Belushi,1949,1982,"actor,soundtrack,writer","tt0077975,tt0072562,tt0080455,tt0078723"
4,nm0000005,Ingmar Bergman,1918,2007,"writer,director,actor","tt0069467,tt0050986,tt0083922,tt0060827"
...,...,...,...,...,...,...
12521710,nm9993714,Romeo del Rosario,\N,\N,"animation_department,art_department","tt11657662,tt2455546,tt14069590"
12521711,nm9993716,Essias Loberg,\N,\N,NaN,\N
12521712,nm9993717,Harikrishnan Rajan,\N,\N,cinematographer,tt8736744
12521713,nm9993718,Aayush Nair,\N,\N,cinematographer,\N
12521714,nm9993719,Andre Hill,\N,\N,NaN,\N

In [72]:
df1.isnull().sum()

nconst                     0
primaryName                3
birthYear                  0
deathYear                  0
primaryProfession    2726802
knownForTitles             0
dtype: int64

In [73]:
# select actor and actress
df1 = df1.loc[df1['primaryProfession'].isin(['actor', 'actress'])]

In [74]:
# select not null values on primaryName column
df1 = df1[df1['primaryName'].notna()]

In [75]:
df1.isnull().sum()

nconst               0
primaryName          0
birthYear            0
deathYear            0
primaryProfession    0
knownForTitles       0
dtype: int64

In [76]:
# eliminate \\N for knownForTitles column
df1 = df1[df1.knownForTitles != '\\N']

In [77]:
# select only the columns we need
df1 = df1[['nconst','primaryName','knownForTitles']].reset_index(drop=True)
df1

,nconst,primaryName,knownForTitles
0,nm0000109,Yasmine Bleeth,"tt0096542,tt0337851,tt0115285,tt0131857"
1,nm0000124,Jennifer Connelly,"tt0180093,tt0315983,tt0102803,tt0268978"
2,nm0000143,Erika Eleniak,"tt0105690,tt0094761,tt0083866,tt0106400"
3,nm0000282,Scott Bairstow,"tt0119925,tt0120512,tt0182587,tt0283084"
4,nm0000283,Brenda Bakke,"tt0119488,tt0107144,tt0114608,tt0114781"
...,...,...,...
3307400,nm9993693,Apsara Rani,"tt13847502,tt12856788,tt8302382,tt8737752"
3307401,nm9993698,Sebi John,tt8736744
3307402,nm9993699,Dani Jacob,tt8736744
3307403,nm9993701,Sanjai Kuriakose,tt8736744
3307404,nm9993703,James Craigmyle,"tt6914160,tt6225166,tt11212278,tt10627062"

In [78]:
df1.to_csv('df1_not_exploded', index=False)

In [79]:
# check the number of unique values on primaryName column
df1.primaryName.nunique()

2920556

In [80]:
df1['knownForTitles'] = df1.knownForTitles.apply(lambda x: x.split(','))
df1 = df1.explode('knownForTitles')
df1

            nconst        primaryName knownForTitles
0        nm0000109     Yasmine Bleeth      tt0096542
0        nm0000109     Yasmine Bleeth      tt0337851
0        nm0000109     Yasmine Bleeth      tt0115285
0        nm0000109     Yasmine Bleeth      tt0131857
1        nm0000124  Jennifer Connelly      tt0180093
...            ...                ...            ...
3307403  nm9993701   Sanjai Kuriakose      tt8736744
3307404  nm9993703    James Craigmyle      tt6914160
3307404  nm9993703    James Craigmyle      tt6225166
3307404  nm9993703    James Craigmyle     tt11212278
3307404  nm9993703    James Craigmyle     tt10627062

[5475409 rows x 3 columns]

In [81]:
#df1.to_csv('df1_actor_names_titles.csv', index=False)

In [82]:
link3 = "https://datasets.imdbws.com/title.basics.tsv.gz"
df3 = pd.read_csv(link3, sep="\t", compression='gzip')
df3.head()

C:\Users\BengÃ¼\AppData\Local\Temp\ipykernel_8696\3514975157.py:2: DtypeWarning: Columns (4) have mixed types. Specify dtype option on import or set low_memory=False.
  df3 = pd.read_csv(link3, sep="\t", compression='gzip')

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

In [83]:
# select not null values on originalTitle column
df3 = df3[df3['originalTitle'].notna()]

In [84]:
# select only movies
df3 = df3[df3.titleType == 'movie']

In [85]:
df3 = df3[df3.startYear != '\\N']
df3 = df3[df3.runtimeMinutes != '\\N']
df3.head(5)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
8,tt0000009,movie,Miss Jerry,Miss Jerry,0,1894,\N,45,Romance
144,tt0000147,movie,The Corbett-Fitzsimmons Fight,The Corbett-Fitzsimmons Fight,0,1897,\N,100,"Documentary,News,Sport"
498,tt0000502,movie,Bohemios,Bohemios,0,1905,\N,100,\N
570,tt0000574,movie,The Story of the Kelly Gang,The Story of the Kelly Gang,0,1906,\N,70,"Action,Adventure,Biography"
587,tt0000591,movie,The Prodigal Son,L'enfant prodigue,0,1907,\N,90,Drama

In [86]:
df3 = df3[['tconst','originalTitle','startYear','runtimeMinutes']].reset_index(drop=True)
df3.head(5)

      tconst                  originalTitle startYear runtimeMinutes
0  tt0000009                     Miss Jerry      1894             45
1  tt0000147  The Corbett-Fitzsimmons Fight      1897            100
2  tt0000502                       Bohemios      1905            100
3  tt0000574    The Story of the Kelly Gang      1906             70
4  tt0000591              L'enfant prodigue      1907             90

In [87]:
df3.isna().sum()

tconst            0
originalTitle     0
startYear         0
runtimeMinutes    0
dtype: int64

In [88]:
#df3.to_csv('df3_movie_names_genres.csv', index=False)

In [89]:
import os
os.getcwd()

'c:\\Users\\BengÃ¼\\Downloads'

In [90]:
os.chdir('c:\\Users\\BengÃ¼\\Downloads')

In [91]:
df_merged1 = df3.merge(df1.rename({'knownForTitles':'tconst'}, axis='columns'), on='tconst', how='left')
df_merged1 = df_merged1.dropna(subset=['nconst'])
# df_merged1.drop(['runtimeMinutes', 'startYear'], axis=1, inplace=True)
df_merged1

,tconst,originalTitle,startYear,runtimeMinutes,nconst,primaryName
0,tt0000009,Miss Jerry,1894,45,nm0063086,Blanche Bayliss
1,tt0000009,Miss Jerry,1894,45,nm0183823,William Courtenay
3,tt0000502,Bohemios,1905,100,nm0215752,Antonio del Pozo
4,tt0000502,Bohemios,1905,100,nm0252720,El Mochuelo
5,tt0000574,The Story of the Kelly Gang,1906,70,nm0143899,Godfrey Cass
...,...,...,...,...,...,...
2198615,tt9916538,Kuambil Lagi Hatiku,2019,123,nm4936523,Kedung Darma R.
2198616,tt9916538,Kuambil Lagi Hatiku,2019,123,nm8678236,Lala Karmela
2198618,tt9916680,De la ilusiÃ³n al desconcierto: cine colombiano...,2007,100,nm0033355,Ramiro ArbelÃ¡ez
2198619,tt9916680,De la ilusiÃ³n al desconcierto: cine colombiano...,2007,100,nm3041223,Jaime Osorio
2198620,tt9916730,6 Gunn,2017,116,nm6096005,Devadhar Archit

In [92]:
# df_merged1.to_csv('df_merged_movie_actor.csv', index=False)

In [93]:
link7 = "https://datasets.imdbws.com/title.ratings.tsv.gz"
df7 = pd.read_csv(link7, sep="\t", compression='gzip')
df7

            tconst  averageRating  numVotes
0        tt0000001            5.7      1971
1        tt0000002            5.8       263
2        tt0000003            6.5      1816
3        tt0000004            5.6       178
4        tt0000005            6.2      2612
...            ...            ...       ...
1309290  tt9916730            8.3        10
1309291  tt9916766            7.0        21
1309292  tt9916778            7.2        36
1309293  tt9916840            8.8         6
1309294  tt9916880            8.2         6

[1309295 rows x 3 columns]

In [94]:
df7.dropna(inplace=True)

In [95]:
df = df_merged1.merge(df7, on='tconst', how='left')
df.dropna(inplace=True)

In [96]:
df

,tconst,originalTitle,startYear,runtimeMinutes,nconst,primaryName,averageRating,numVotes
0,tt0000009,Miss Jerry,1894,45,nm0063086,Blanche Bayliss,5.3,204.0
1,tt0000009,Miss Jerry,1894,45,nm0183823,William Courtenay,5.3,204.0
2,tt0000502,Bohemios,1905,100,nm0215752,Antonio del Pozo,4.1,15.0
3,tt0000502,Bohemios,1905,100,nm0252720,El Mochuelo,4.1,15.0
4,tt0000574,The Story of the Kelly Gang,1906,70,nm0143899,Godfrey Cass,6.0,826.0
...,...,...,...,...,...,...,...,...
2070141,tt9916538,Kuambil Lagi Hatiku,2019,123,nm10041459,Sahil Shah,8.6,7.0
2070142,tt9916538,Kuambil Lagi Hatiku,2019,123,nm3369416,Yati Pesek,8.6,7.0
2070143,tt9916538,Kuambil Lagi Hatiku,2019,123,nm4936523,Kedung Darma R.,8.6,7.0
2070144,tt9916538,Kuambil Lagi Hatiku,2019,123,nm8678236,Lala Karmela,8.6,7.0
2070147,tt9916730,6 Gunn,2017,116,nm6096005,Devadhar Archit,8.3,10.0

In [97]:
# df.to_csv('df_actor_avgrating.csv', index=False)

In [98]:
df = df[df['numVotes'] > 6804]

In [99]:
# remove rows with non-english characters on actor names
df = df[df['primaryName'].apply(lambda x: bool(re.match('^[a-zA-Z0-9\s]+$', x)))]
# remove rows with punctuations and numbers on actor names
df = df[~df['primaryName'].str.contains('[^\w\s]')]
df = df[~df['primaryName'].str.contains(r'\d+')]

In [100]:
def weighted_average(group):
  return (group['averageRating'] * group['numVotes']).sum() / group['numVotes'].sum()

df_actor_rating = df.groupby('primaryName').apply(weighted_average).reset_index(name='weighted_average')
df_actor_rating

                primaryName  weighted_average
0                  AJ Diana          6.900000
1                   AJ Kane          7.400000
2             AJ Littlejohn          6.200000
3                 AJ Meijer          6.300000
4                 AJ Taylor          7.716993
...                     ...               ...
150399  Zwelithin Mathebula          6.500000
150400            Zwi Kanar          7.600000
150401       Zyad Bin Hijab          1.000000
150402    Zygmunt Szajowski          7.300000
150403              sisi li          7.000000

[150404 rows x 2 columns]

In [101]:
df_actor_rating.to_csv('df_actor_avgrating.csv', index=False)

In [102]:
df_actor_rating.merge(df_merged1, on='primaryName', how='left')

,primaryName,weighted_average,tconst,originalTitle,startYear,runtimeMinutes,nconst
0,AJ Diana,6.9,tt1549572,Another Earth,2011,92,nm4543466
1,AJ Kane,7.4,tt2386490,How to Train Your Dragon: The Hidden World,2019,104,nm7851743
2,AJ Littlejohn,6.2,tt3155328,Win It All,2017,88,nm5366782
3,AJ Meijer,6.3,tt15185022,See You Next Christmas,2021,99,nm2973791
4,AJ Meijer,6.3,tt2503954,Broken Horses,2015,101,nm2973791
...,...,...,...,...,...,...,...
306414,Zwi Kanar,7.6,tt0202077,Voyages,1999,115,nm0437108
306415,Zwi Kanar,7.6,tt0486580,Forgiveness,2006,97,nm0437108
306416,Zyad Bin Hijab,1.0,tt13423846,321 Action,2020,100,nm12046861
306417,Zygmunt Szajowski,7.3,tt4385888,20th Century Women,2016,119,nm5284622
306418,sisi li,7.0,tt0473444,Man cheng jin dai huang jin jia,2006,114,nm12113921